[
  {
    "id": "6432fb5a5695a6229fb6c255",
    "logo": "https://i.ibb.co/kBPgB65/netflix-4-1.png",
    "jobTitle": "Senior Product Designer",
    "companyName": "Netflix",
    "remoteOrOnsite": "Onsite",
    "location": "Atlanta, Boston",
    "jobTime": "Full Time",
    "Salary": "100K - 150K",
    "jobDescription": "Netflix is seeking an experienced designer to help build our consumer product shopping experience. In this position you’ll work with a team of industry and domain experts that own the product design life cycle, from product inception to delivery. The scope includes UX, visual, and motion design and includes tools and experiences for the Netflix app and website, growth, partner integrations, merchandising systems, ad systems and Netflix's loyalty program, Fam. A successful senior designer at Netflix must be collaborative and work closely across functions to drive differentiated products in a space that is ripe for innovation.",
    "JobResponsibility": "You will be responsible for designing customer experiences from start to finish. This involves coordinating cross-product designs to create cutting-edge product experiences. You will oversee the design process from planning to product delivery, working with senior leaders in engineering, product, and marketing. Additionally, you will use your knowledge of service design ecosystems to identify opportunities and get everyone aligned towards a common goal.",
    "requirements": "We are seeking a candidate with at least 8 years of experience in creating outstanding consumer and/or platform products. You should be able to work in a creative and experimental environment, while being completely focused on solving customer needs. Strong organizational skills, attention to detail, and analytic capabilities are also important. In addition, you should possess excellent communication skills and be able to effectively present to senior leadership, board of directors, and other key stakeholders. Experience with motion and/or haptics is a plus. A relevant bachelor's degree or equivalent professional qualification is required.",
    "experiences": "5",
    "contactInfo": "jobs@netflix.com"
  },
  {
    "id": "6432fb5ae7db73db4c58cc2f",
    "logo": "https://i.ibb.co/KDSvg5m/tesla-9-1.png",
    "jobTitle": "Software Engineer",
    "companyName": "Tesla",
    "remoteOrOnsite": "Remote",
    "location": "Nashville, Portland",
    "jobTime": "Full Time ",
    "Salary": "150K - 200K",
    "jobDescription": "As a Backend Software Engineer at Tesla, you will be part of the team that builds and supports the system that powers the Tesla experience for millions of customers. We empower our engineers to own the code they write by fostering a culture that believes in testing, code reviews, metrics/instrumentation, experimentation, and operational excellence. We aim to champion a collaborative, fun, and inclusive environment where all ideas are welcome.",
    "JobResponsibility": "Our company is seeking a software engineer who will work with our product and client teams to ensure timely delivery of product roadmap items. As a member of the Backend team, you will be responsible for monitoring and maintaining backend services and infrastructure. You will develop and maintain APIs that can handle high traffic loads of up to 500k RPM. Your work will involve writing high-quality code, creating accompanying tests, and participating in design discussions to ensure the success of the team. Additionally, you will be expected to perform other duties as assigned.",
    "requirements": "Our ideal candidate should have at least 2 years of full-time software engineering experience, and a degree in computer science or an equivalent field. You should be experienced in at least one backend server language such as Go, Ruby, Python, Java, C++, C#, Rust, or Scala, and have experience with version control systems such as git. Experience with database storage systems, particularly MongoDB, Postgres, MySQL, or Cloud Spanner, is preferred, as is experience working with a major cloud platform such as AWS, Google Cloud, or Azure. Familiarity with microservices is also desirable.",
    "experiences": "7+",
    "contactInfo": "jobs@tesla.com"
  },
  {
    "id": "6432fb5a9e9ce682aded078f",
    "logo": "https://i.ibb.co/V3Cfvd9/google-1-1-1.png",
    "jobTitle": "Technical Database Engineer",
    "companyName": "Google LLC",
    "remoteOrOnsite": "Remote",
    "location": "Chicago, Austin",
    "jobTime": "Full Time",
    "Salary": "70K - 90K",
    "jobDescription": "We are seeking a candidate who can meet MMC's standards for application and database development. You will work in various team workflows including Agile and Waterfall and collaborate with functional groups and project management to ensure that project plans reflect milestones and timelines. Technical designs must be documented using Erwin diagrams, flowcharts, data flow diagrams, and descriptive software component documentation as needed. You will also design, review, analyze, and provide feedback on data models, ETL, and application processes, and develop database objects such as tables, views, functions, and stored procedures to support business processes.",
    "JobResponsibility": "Maintaining data management compliance and best practices, evaluating data sets to determine keys and other relationships, identifying and resolving database and application performance issues, and monitoring database backups are other responsibilities of the role. You must also be able to manage SQL servers, deploy changes to production databases, troubleshoot issues with automated processes, and conduct code review sessions with other developers. Additionally, you will work with internal teams to perform maintenance and upgrades to SQL servers and create and maintain testing of ETL and data processing processes.",
    "requirements": "The ideal candidate should have a deep understanding of database structures and their application in business processes, excellent analytical and problem-solving skills, and knowledge of SQL servers and database management. You should be able to review business requirements and suggest solutions based on industry and MMC best practices.",
    "experiences": "3+",
    "contactInfo": "jobs@google.com"
  },
  {
    "id": "6432fb5a93a953d277d3aa98",
    "logo": "https://i.ibb.co/VQ2nPt8/Group-10021.png",
    "jobTitle": "Motion Graphic Designer",
    "companyName": "Airbnb LLC",
    "remoteOrOnsite": "Onsite",
    "location": "New Orleans, San Francisco",
    "jobTime": "Full Time",
    "Salary": "50K - 70K",
    "jobDescription": "We’re seeking a talented, collaborative, and curious UI designer who is skilled in the fundamentals of UI design and UI motion design. The ideal candidate will have design expertise in a variety of digital channels and demonstrate a passion for delivering adaptive and creative design solutions by staying current with emerging trends and best practices. They must be able to show and demonstrate their ability to animate graphic elements in user interfaces, have an acute understanding of how motion design enhances and creates a more intuitive user experience. They must be able to show and demonstrate experience creating animated graphics for a variety of purposes and digital channels. As a UI Motion Designer at Bold Orange, you will be responsible for contributing ideas and design solutions to a variety of digital experiences across all industries and channels, with an acute understanding of the connected customer experience. You will ensure all design elements are optimized for improved usability, usefulness, and exceptional visual design. You’ll work closely with the entire creative team, project management and the client services team from kickoff to execution to create effective and cohesive projects.",
    "JobResponsibility": "As a designer, you will be responsible for creating purposeful design elements, patterns, modular assets, and templates that are cohesive and efficient for development. Collaboration with various teams such as strategy, marketing, and developers will be necessary to ensure the creation and delivery meet high standards for design excellence and defined business objectives. We are looking for someone who can solve problems with fresh and forward-thinking execution and has a bold and broad-thinking approach to their work. You should be willing to bring additional ideas beyond the original request and be known for providing the at Bold Orange.",
    "requirements": "The ideal candidate for this job should have a Bachelor's degree in graphic arts, design, visual communications, user experience design, or equivalent work experience. They should also have at least 3 years of experience in digital design with multi-channel expertise. They should have working knowledge of creative applications such as Figma, Animate, Adobe After Effects, Photoshop, Illustrator, XD, Sketch, InDesign, iOS, Android, and design systems. Familiarity with HTML and CSS is preferred. The candidate should have a digital portfolio or work samples that demonstrate professional digital design work for various projects, applications, and channels. They should also have experience designing and creating animated graphics, GIFs, video effects, and motion design for all types of user interfaces and channels, including web, native and web-based apps, email, social media, video, and digital media.",
    "experiences": "2+",
    "contactInfo": "jobs@airbnb.com"
  },
  {
    "id": "6432fb5aeafb833bb64477bf",
    "logo": "https://i.ibb.co/V3Cfvd9/google-1-1-1.png",
    "jobTitle": "Senior Technical Coach",
    "companyName": "Airbnb LLC",
    "remoteOrOnsite": "Onsite",
    "location": "Denver, Philadelphia",
    "jobTime": "Full Time",
    "Salary": "60k-90k",
    "jobDescription": "Established in 1946, with headquarters in Arlington, Virginia, AIR is a nonpartisan, not-for-profit institution that conducts behavioral and social science research and delivers technical assistance to solve some of the most urgent challenges in the U.S. and around the world. We advance evidence in the areas of education, health, the workforce, human services, and international development to create a better, more equitable world. AIR’s commitment to diversity goes beyond legal compliance to its full integration in our strategy, operations, and work environment. At AIR, we define diversity broadly, considering everyone’s unique life and community experiences. We believe that embracing diverse perspectives, abilities/disabilities, racial/ethnic and cultural backgrounds, styles, ages, genders, gender identities and expressions, education backgrounds, and life stories drives innovation and employee engagement. Learn more about AIR's Diversity, Equity, and Inclusion Strategy and hear from our staff by clicking here.",
    "JobResponsibility": "As an Education Project Manager, you will be responsible for coordinating and leading project teams to develop and implement tools and processes that support state and district teams in strengthening and diversifying the educator workforce. You will also be responsible for designing and facilitating professional learning activities and coaching to strengthen teacher instructional practices.In addition, you will guide data-driven decisions aimed at stabilizing, supporting, and diversifying the educator workforce. You will serve as a subject matter expert, advisor, and thought partner to district and state leaders, and develop high-quality resources, briefs, and tools. To succeed in this role, you must be able to integrate effective project management and quality methods to manage fast-paced projects of high complexity. Additionally, you should have experience designing and facilitating sessions and stakeholder meetings that support educator talent management policy and practice decisions, such as mentoring and induction, grow your own, teacher apprenticeships, teacher preparation, and teacher leadership.",
    "requirements": "The ideal candidate should have a Bachelor's degree in education, business, or a related field, along with 3-5 years of experience in education project management. You should have excellent communication, organization, and leadership skills, with the ability to work collaboratively with project teams and stakeholders.",
    "experiences": "1+",
    "contactInfo": "jobs@airbnb.com"
  },
  {
    "id": "6432fb5a25970061fa4f5bdd",
    "logo": "https://i.ibb.co/kBPgB65/netflix-4-1.png",
    "jobTitle": "Sr Java Full Stack Developer",
    "companyName": "Netflix",
    "remoteOrOnsite": "Remote",
    "location": "Seattle, Miami",
    "jobTime": "Full Time",
    "Salary": "150K - 200K",
    "jobDescription": "Cognizant is a company that fosters creativity and innovation, and they are looking for people with big ideas. They help companies reinvent their business models and create new value by connecting people with things, insights, and experiences. Cognizant's digital engineering team specializes in designing, engineering, and delivering digital products and experiences that drive digital-first business models. They offer a comprehensive approach that combines expertise in digital engineering and a client-centric methodology to drive sustainable innovation. Cognizant's goal is to create digital products and experiences that meet the needs of their clients while driving innovation and growth.",
    "JobResponsibility": "As a software developer, your primary duties will involve participating in all phases of the development and maintenance life cycle. You will collaborate with product owners, engineers, and graphic designers to analyze and estimate requirements. You will analyze and evaluate detailed business and technical requirements and code and maintain complex components of information systems. You will supervise the preparation of designs and technical and/or functional specifications. You should be comfortable working in a fast-paced, Agile environment and be able to mentor others on coding standards and perform code reviews. You will also develop and perform unit testing and fix defects identified during testing and re-execute unit tests to validate results. Additionally, you will aid in integrating activities with other IT departments for successful implementation and support of project efforts.",
    "requirements": "The ideal candidate should have at least 8 years of experience as an application developer with expertise in Java Spring Boot Microservices, Kafka, and Cassandra. They should also have hands-on experience with app containerization and/or migration to the cloud, preferably with exposure to Kubernetes. The candidate should be able to resolve cloud migration or containerization issues related to a variety of languages and frameworks. They should have strong coding skills with an understanding of the full stack, including back-end and front-end development, network infrastructure, and relational and non-relational databases. The candidate should be skilled in pair programming (XP) and use an empathetic approach. They should have excellent experience in understanding coding best practices/guidelines, Lean Agile, TDD, CI/CD, and Docker. The ideal candidate should closely work with Scrum Masters, QEA lead, and Developers on a day-to-day basis managing overall timelines in addition to their own deliverables. They should understand the integration system built and take up any development.",
    "experiences": "8+",
    "contactInfo": "jobs@netflix.com"
  }
]
